# 1.Importing Liraries

In [128]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from sklearn.model_selection import train_test_split

# 2.Reading Data

In [5]:
PROJECT_DIR = r"C:\Users\Abhishek\Documents\churn-rate-project"
DATA_DIR = "Data"

In [6]:
def get_data(name):
    fname = f"{name}.csv"
    fpath = os.path.join(PROJECT_DIR,DATA_DIR,fname)
    return pd.read_csv(fpath)

In [7]:
df = get_data('Churn_Modelling')

In [8]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [9]:
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

# 3.Preliminary Analysis

## 3.1 Check Data Types

In [13]:
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [15]:
df.dtypes

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

## 3.2 Check for Duplicates

In [17]:
 df.duplicated().sum()

0

## 3.3 Observations

- We have some features that are not of use like customer id and Row Number
- We dont have any Duplicated values
- The Dataset looks clean but we will see it in Detailed Analysis

# 4. Detailed Analysis of Each Column

## RowNumber

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [38]:
df['RowNumber']

0           1
1           2
2           3
3           4
4           5
        ...
9995     9996
9996     9997
9997     9998
9998     9999
9999    10000
Name: RowNumber, Length: 10000, dtype: int64

In [41]:
# Droping Row Number Column
(
    df
    .drop(columns=['RowNumber'])
)

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

- We Dont need this feature we can simply Drop it

## CustomerId

In [45]:
df['CustomerId']

0       15634602
1       15647311
2       15619304
3       15701354
4       15737888
          ...
9995    15606229
9996    15569892
9997    15584532
9998    15682355
9999    15628319
Name: CustomerId, Length: 10000, dtype: int64

- We can Drop this column also

## Surname

In [49]:
df['Surname'].unique()

array(['Hargrave', 'Hill', 'Onio', ..., 'Kashiwagi', 'Aldridge',
       'Burbidge'], dtype=object)

## CreditScore

In [52]:
df['CreditScore']

0       619
1       608
2       502
3       699
4       850
       ...
9995    771
9996    516
9997    709
9998    772
9999    792
Name: CreditScore, Length: 10000, dtype: int64

## Geography

In [55]:
df['Geography']

0        France
1         Spain
2        France
3        France
4         Spain
         ...
9995     France
9996     France
9997     France
9998    Germany
9999     France
Name: Geography, Length: 10000, dtype: object

In [57]:
df['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

## Gender

In [60]:
df['Gender']

0       Female
1       Female
2       Female
3       Female
4       Female
         ...
9995      Male
9996      Male
9997    Female
9998      Male
9999    Female
Name: Gender, Length: 10000, dtype: object

In [62]:
df['Gender'].unique()

array(['Female', 'Male'], dtype=object)

## Age

In [65]:
df['Age']

0       42
1       41
2       42
3       39
4       43
        ..
9995    39
9996    35
9997    36
9998    42
9999    28
Name: Age, Length: 10000, dtype: int64

In [67]:
df['Age'].min()

18

In [69]:
df['Age'].max()

92

## Tenure

In [72]:
df['Tenure']

0        2
1        1
2        8
3        1
4        2
        ..
9995     5
9996    10
9997     7
9998     3
9999     4
Name: Tenure, Length: 10000, dtype: int64

In [74]:
df['Tenure'].unique()

array([ 2,  1,  8,  7,  4,  6,  3, 10,  5,  9,  0], dtype=int64)

## Balance

In [77]:
df['Balance']

0            0.00
1        83807.86
2       159660.80
3            0.00
4       125510.82
          ...
9995         0.00
9996     57369.61
9997         0.00
9998     75075.31
9999    130142.79
Name: Balance, Length: 10000, dtype: float64

## NumOfProducts

In [80]:
df['NumOfProducts']

0       1
1       1
2       3
3       2
4       1
       ..
9995    2
9996    1
9997    1
9998    2
9999    1
Name: NumOfProducts, Length: 10000, dtype: int64

In [82]:
df['NumOfProducts'].unique()

array([1, 3, 2, 4], dtype=int64)

## HasCrCard

In [85]:
df['HasCrCard']

0       1
1       0
2       1
3       0
4       1
       ..
9995    1
9996    1
9997    0
9998    1
9999    1
Name: HasCrCard, Length: 10000, dtype: int64

In [87]:
df['HasCrCard'].unique()

array([1, 0], dtype=int64)

## IsActiveMember

In [90]:
df['IsActiveMember']

0       1
1       1
2       0
3       0
4       1
       ..
9995    0
9996    1
9997    1
9998    0
9999    0
Name: IsActiveMember, Length: 10000, dtype: int64

In [92]:
df['IsActiveMember'].unique()

array([1, 0], dtype=int64)

## EstimatedSalary

In [95]:
df['EstimatedSalary']

0       101348.88
1       112542.58
2       113931.57
3        93826.63
4        79084.10
          ...
9995     96270.64
9996    101699.77
9997     42085.58
9998     92888.52
9999     38190.78
Name: EstimatedSalary, Length: 10000, dtype: float64

In [97]:
df['EstimatedSalary'].min()

11.58

In [99]:
df['EstimatedSalary'].max()

199992.48

## Exited

In [102]:
df['Exited']

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [104]:
df['Exited'].unique()

array([1, 0], dtype=int64)

# 5. Cleaning Operation

### Note before cleaning
- Drop RowNumber column
- Drop CustomerId column
- change column name to lower-case
- Trim all categorical columns
- Convert Geography, Gender, NumOfProducts, HasCrCard, IsActiveMember, Exited column to Categorical Column

In [108]:
def toCategorical(df,col):
    return (
        df[col]
        .astype('category')
    )

In [110]:
def cleanData(df):
    return (
        df
        .drop(columns=['RowNumber','CustomerId'])# These columns are not of any use so we can drop these columns
        .rename(columns=str.lower) # make all columns name to lower case for avoiding error in next steps
        .assign(
            geography = lambda df_ : toCategorical(df_,'geography'),
            gender = lambda df_ : toCategorical(df_,'gender'),
            numofproducts= lambda df_ : toCategorical(df_,'numofproducts'),
            hascrcard = lambda df_ : toCategorical(df_,'hascrcard'),
            isactivemember = lambda df_ : toCategorical(df_,'isactivemember'),
            exited = lambda df_ : toCategorical(df_,'exited'),
            
            
        )
    )

In [116]:
finalData = cleanData(df)
finalData

,surname,creditscore,geography,gender,age,tenure,balance,numofproducts,hascrcard,isactivemember,estimatedsalary,exited
0,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

# 6. Split the Data

In [120]:
sample_data = finalData.sample(3000)

In [124]:
X = sample_data.drop(columns = 'exited')
y = sample_data.exited.copy()

In [130]:
X_, X_test,y_, y_test = train_test_split(X,y,test_size=0.2,random_state= 42)
X_train, X_val, y_train, y_val = train_test_split(X_,y_,test_size=0.2,random_state=42)

# 7.Export The Subsets

In [132]:
def export_data(X,y,name):
    file_name = f"{name}.csv"
    file_path = os.path.join(PROJECT_DIR,DATA_DIR,file_name)
    X.join(y).to_csv(file_path,index=False)
    return pd.read_csv(file_path).head(5)

In [138]:
train = export_data(X_train,y_train,'train')
test = export_data(X_test,y_test,'test')
val = export_data(X_val,y_val,'val')

In [140]:
print(train)
print(test)
print(val)

       surname  creditscore geography  gender  age  tenure    balance  \
0       Howard          727   Germany    Male   34       2  146407.11
1  Chukwunonso          773     Spain  Female   39       4       0.00
2         Chia          759     Spain    Male   31       8       0.00
3         Kent          626   Germany    Male   35       4   88109.81
4        Mazzi          686    France  Female   34       3  123971.51

   numofproducts  hascrcard  isactivemember  estimatedsalary  exited
0              1          1               1         72073.72       0
1              2          0               1        182081.45       0
2              2          1               1         99086.74       0
3              1          1               1         32825.50       0
4              2          1               0        147794.63       0
       surname  creditscore geography  gender  age  tenure    balance  \
0     Lucchese          453   Germany  Female   28       3  139986.65
1   Fitzgerald          691    France  Female   29       9       0.00
2  Bergamaschi          631    France    Male   32      10       0.00
3     Williams          694    France    Male   47       4       0.00
4    Stradford          494     Spain    Male   67       5       0.00

   numofproducts  hascrcard  isactivemember  estimatedsalary  exited
0              1          1               0        136846.75       0
1              2          0               0        199635.93       0
2              2          0               1        196342.66       0
3              2          1               0        197528.62       0
4              2          1               1         85890.16       0
     surname  creditscore geography  gender  age  tenure    balance  \
0  Clogstoun          850    France    Male   43       4  161256.53
1     Hooper          702    France  Female   40       1  103549.24
2   Lawrence          601    France    Male   29       9       0.00
3   Tokaryev          735     Spain    Male   29      10       0.00
4       Tsao          541    France    Male   34       3  128743.55

   numofproducts  hascrcard  isactivemember  estimatedsalary  exited
0              1          1               1        140071.57       0
1              1          0               0          9712.52       1
2              1          1               1         80393.27       0
3              2          1               1         95025.27       0
4              1          1               0        134851.12       0